Revit 2024 API
RebarLayoutRule Enumeration
 The rule for how the rebars in rebar set are laid out
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum RebarLayoutRule
Visual Basic
Public Enumeration RebarLayoutRule
Visual C++
public enum class RebarLayoutRule
Members
Member name | Description
Single |  It is a single rebar and not a rebar set.
FixedNumber |  The spacing between the rebar is adjustable, but the number of bars is constant based on input.
MaximumSpacing |  The maximum distance between rebar is specified by input, and the number of rebar changes based on the length of rebar set.
NumberWithSpacing |  Both the spacing between rebar and the number of rebar are constant based on input.
MinimumClearSpacing |  The minimum distance between rebar is specified by input, and the number of rebar changes based on the length of rebar set. This spacing is maintained even if the rebar size changes.
See Also
Autodesk.Revit.DB.Structure Namespace